Emagician-Base.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-18 Fri 10:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emagician-Base</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jonathan Arkell" />
<link href="https://fonts.googleapis.com/css?family=Inconsolata|Nixie+One|Taviraj:300,400" rel="stylesheet"><link href="./assets/styles/tufte-style.css" rel="stylesheet"></head>
<body>
<div id="preamble" class="status">
<menu class="top"><a href="index.html"> Index </a><a href="Emagician.html"> Emagician </a><a href="Emagician-Base.html"> Base </a><a href="Emagician-Install.html"> Install </a><a href="Emagician-Meta.html"> Meta </a><a href="Interface.html"> Interface </a><a href="Programming.html"> Programming </a><a href="Text.html"> Text </a><a href="Org-Grimoire.html"> Org </a><a href="Lamp.html"> Lamp </a><a href="Journal.html"> Journal </a><a href="Snippets.html"> Snippets </a></menu><menu class="ext"><a class="dotnet" href="http://www.jonnay.net/">jonnay.net</a><a class="github" href="https://github.com/jonnay/emagicians-starter-kit">Fork on Github</a></menu>
</div>
<div id="content">
<h1 class="title">Emagician-Base</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5931013">1. Bassline / Baseline</a></li>
<li><a href="#org059ddbe">2. Basic helpers</a></li>
<li><a href="#org532518a">3. Emacs Lisp Evaluation Environment</a>
<ul>
<li><a href="#org4dfef0e">3.1. Garbage Collection</a></li>
<li><a href="#orgb886716">3.2. Prefer new files</a></li>
<li><a href="#org61c51b9">3.3. Lexical Evaluation</a></li>
<li><a href="#orge8edba1">3.4. Common Lisp</a></li>
<li><a href="#org10d7dca">3.5. Evaluation and Printing</a></li>
<li><a href="#org31a72a7">3.6. Anaphoric Goodness</a></li>
<li><a href="#org7101cd5">3.7. Asyc</a></li>
<li><a href="#org68286f2">3.8. Testing</a></li>
<li><a href="#org9a8e918">3.9. Memory Usage</a></li>
</ul>
</li>
<li><a href="#org404e019">4. emagick-🐰 Extensions to Emacs Lisp</a>
<ul>
<li><a href="#org5023e82">4.1. Test suite</a></li>
<li><a href="#org4eba860">4.2. alist-set: Change element in list</a></li>
</ul>
</li>
<li><a href="#orga551aab">5. Emagician Helpers</a>
<ul>
<li><a href="#org406730a">5.1. Hook Helpers</a>
<ul>
<li><a href="#orge39cd63">5.1.1. Minor In Major</a></li>
<li><a href="#org8554f90">5.1.2. Def hook</a>
<ul>
<li><a href="#org2780b8e">5.1.2.1. Unit tests</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgdde00cc">5.2. Backtrace Magick</a></li>
<li><a href="#org8938658">5.3. Sanitize File name</a></li>
<li><a href="#orgceaac27">5.4. Expect Dir</a></li>
<li><a href="#org2317285">5.5. Add to Path</a></li>
<li><a href="#org40cf2a7">5.6. Final Emagician Scratch</a>
<ul>
<li><a href="#org2b809d9">5.6.1. Scratchify</a></li>
<li><a href="#org84b69da">5.6.2. Reset Scratch</a></li>
<li><a href="#orgddcea02">5.6.3. Main Scratch Initiation</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org5931013" class="outline-2">
<h2 id="org5931013"><span class="section-number-2">1</span> Bassline / Baseline</h2>
<div class="outline-text-2" id="text-1">
<p>
A baseline set of functions that are helpers for the rest of the Emagician Starter Kit.
</p>

<ul class="org-ul">
<li>Basic helpers in case there is a problem loading</li>
<li>Extend emacs lisp evaluation environment</li>
<li>emagick-🐰 functions to further extend emacs lisp</li>
<li>Emagician helpers to make configuration much easier.</li>
</ul>
</div>
</div>

<div id="outline-container-org059ddbe" class="outline-2">
<h2 id="org059ddbe"><span class="section-number-2">2</span> Basic helpers</h2>
<div class="outline-text-2" id="text-2">
<p>
Just enough to make editing in a broken environment not a pain,
</p>

<pre class="code"><code>(<span class="org-keyword">require</span> '<span class="org-constant">ffap</span>)  <span class="org-comment-delimiter">; </span><span class="org-comment">Will be superceeded, but important when stuff gets broke.</span>
</code></pre>
</div>
</div>

<div id="outline-container-org532518a" class="outline-2">
<h2 id="org532518a"><span class="section-number-2">3</span> Emacs Lisp Evaluation Environment</h2>
<div class="outline-text-2" id="text-3">
<p>
There are helpers funcitons and variables that just make working with Emacs Lisp that much nicer.
</p>
</div>

<div id="outline-container-org4dfef0e" class="outline-3">
<h3 id="org4dfef0e"><span class="section-number-3">3.1</span> Garbage Collection</h3>
<div class="outline-text-3" id="text-3-1">
<div class="epigraph"><blockquote>
<p>
50 Megs, or 10 percent of the heap.  Seems legit.  It's original value is 800000.  Which seems like a lot, but its' really only 800 K.
</p>

<footer>Motherfucker-past-jonnay</footer></blockquote></div>

<p>
Resulting in this abomination:
</p>

<pre class="code"><code>(<span class="org-keyword">setq</span> gc-cons-threshold (* 500 1024 1024))
</code></pre>

<p>
There was even a little voice in my head that said "Maybe Jonnay, maybe you shouldn't fuck with the garbage collector?"
</p>

<p>
Which gave me these lessons:
</p>

<ul class="org-ul">
<li>Listen to that little voice, and</li>
<li>don't fuck around with garbage collection unless you know what you're doing and what you're setting.</li>
</ul>

<p>
One thing you can do is to set Garbage Collection to a high value during startup or execution of commands, and then set it back down to a reasonable value afterwards.  That doesn't change the timing of garbage collection only forstalls it for one big stoppa-tha-world.
</p>

<p>
Another option is to handle the setting of the GC value after a period of idle time.  This would be great for startup, but kinda horrible for command execution. 
</p>

<p>
<a href="http://bling.github.io/blog/2016/01/18/why-are-you-changing-gc-cons-threshold/">http://bling.github.io/blog/2016/01/18/why-are-you-changing-gc-cons-threshold/</a>
</p>

<pre class="code"><code>(<span class="org-keyword">defvar</span> <span class="org-variable-name">lou-the-gc-max</span> (* 512 1024 1024)
  <span class="org-doc">"Maximum Size of garbage collector.  Half gig seems reasonable.</span>
<span class="org-doc">This value is basically not sane."</span>)

(<span class="org-keyword">defvar</span> <span class="org-variable-name">lou-the-gc-sane</span> (car (get 'gc-cons-threshold 'standard-value))
  <span class="org-doc">"Sane GC Value, straight from The Yaks Mouth."</span>)

(<span class="org-keyword">defvar</span> <span class="org-variable-name">lou-is-chatty</span> t
  <span class="org-doc">"Whether or not Lou is chatty about debug messages"</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">lou-the-gc-go-crazy</span> ()
  <span class="org-doc">"Tell Lou the garbage collector to use maximum garbage size"</span>
  (<span class="org-keyword">when</span> lou-is-chatty
    (<span class="org-keyword">with-current-buffer</span> (messages-buffer)
      (<span class="org-keyword">let</span> ((inhibit-read-only t))
        (goto-char (point-max))
        (insert <span class="org-string">"\nLou is going crazy!"</span>))))
  (<span class="org-keyword">setq</span> gc-cons-threshold lou-the-gc-max))

(<span class="org-keyword">defun</span> <span class="org-function-name">lou-the-gc-be-sane</span> ()
  <span class="org-doc">"Tell Lou to stop acting crazy and use a sane garbage collection ammount"</span>
  (<span class="org-keyword">when</span> lou-is-chatty
    (<span class="org-keyword">with-current-buffer</span> (messages-buffer)
      (<span class="org-keyword">let</span> ((inhibit-read-only t))
        (goto-char (point-max))
        (insert <span class="org-string">"\nLou is sane again."</span>))))

  (<span class="org-keyword">setq</span> gc-cons-threshold lou-the-gc-sane))

(<span class="org-keyword">unless</span> after-init-time
  (lou-the-gc-go-crazy)
  (add-hook 'emacs-startup-hook #'lou-the-gc-be-sane t))

(add-hook 'minibuffer-setup-hook #'lou-the-gc-go-crazy)
(add-hook 'minibuffer-exit-hook #'lou-the-gc-be-sane)
</code></pre>
</div>
</div>


<div id="outline-container-orgb886716" class="outline-3">
<h3 id="orgb886716"><span class="section-number-3">3.2</span> Prefer new files</h3>
<div class="outline-text-3" id="text-3-2">
<pre class="code"><code>(<span class="org-keyword">setq</span> load-prefer-newer t)
</code></pre>
</div>
</div>

<div id="outline-container-org61c51b9" class="outline-3">
<h3 id="org61c51b9"><span class="section-number-3">3.3</span> Lexical Evaluation</h3>
<div class="outline-text-3" id="text-3-3">
<pre class="code"><code>(<span class="org-keyword">defmacro</span> <span class="org-function-name">lexically</span> (<span class="org-type">&amp;rest</span> forms)
  <span class="org-doc">"Lexically execute forms"</span>
  `(eval '(<span class="org-keyword">progn</span> ,@forms) t))
</code></pre>

<pre class="code"><code>(<span class="org-keyword">ert-deftest</span> <span class="org-function-name">lexially</span> () 
  (<span class="org-keyword">should</span> (equal (macroexpand '(lexically t t t)) '(eval (<span class="org-keyword">quote</span> (<span class="org-keyword">progn</span> t t t)) t)))) 
</code></pre>
</div>
</div>

<div id="outline-container-orge8edba1" class="outline-3">
<h3 id="orge8edba1"><span class="section-number-3">3.4</span> Common Lisp</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Sometimes the depricated CL environment is still required.  One day
this can go away. That day isn't today.
</p>

<pre class="code"><code>(<span class="org-keyword">require</span> '<span class="org-constant">cl</span>)
</code></pre>
</div>
</div>

<div id="outline-container-org10d7dca" class="outline-3">
<h3 id="org10d7dca"><span class="section-number-3">3.5</span> Evaluation and Printing</h3>
<div class="outline-text-3" id="text-3-5">
<pre class="code"><code>(<span class="org-keyword">setq</span> eval-expression-print-length 9000
      print-length 90000
      eval-expression-print-level 20
      print-level 900)
</code></pre>
</div>
</div>

<div id="outline-container-org31a72a7" class="outline-3">
<h3 id="org31a72a7"><span class="section-number-3">3.6</span> Anaphoric Goodness</h3>
<div class="outline-text-3" id="text-3-6">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">anaphora</span>)
</code></pre>
</div>
</div>

<div id="outline-container-org7101cd5" class="outline-3">
<h3 id="org7101cd5"><span class="section-number-3">3.7</span> Asyc</h3>
<div class="outline-text-3" id="text-3-7">
<p>
Run commands asyncronously. 
</p>

<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">async</span>)
</code></pre>
</div>
</div>

<div id="outline-container-org68286f2" class="outline-3">
<h3 id="org68286f2"><span class="section-number-3">3.8</span> Testing</h3>
<div class="outline-text-3" id="text-3-8">
<p>
ERT for testing.  Of course.
</p>

<p>
El-mock is too damn rubylike.  
</p>

<p>
Fakir is cool ass, but I don't need it.  yet.  Also, a great name
</p>

<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">noflet</span>)
</code></pre>
</div>
</div>
