Emagician-Base.org
** Memory Usage
#+begin_src emacs-lisp 
(use-package memory-usage)
#+end_src

* emagick-🐰 Extensions to Emacs Lisp
** Test suite
#+begin_src emacs-lisp 
(defun emagician/meta/run-all-emagick-tests ()
  "Run all tests for emagick-🐰" 
  (interactive)
  (ert-run-tests-interactively "emagick"))
#+end_src

** alist-set: Change element in list
#+begin_src emacs-lisp 
(defun emagick-🐰/alist-set (key value alist &optional use-proper-list)
  "Sets or adds KEY with VALUE on ALIST, and return the list.
If USE-PROPER-LIST is true then instead of a (dotted . list) a
(proper list) is constructed insted."
  (let ((list-frag (funcall (if use-proper-list #'list #'cons)
                            key
                            value)))
    (if (not (null alist))
        (cons list-frag
              (assq-delete-all key alist))
      (list list-frag))))

(ert-deftest emagick-🐰/alist-set-on-empty-list ()
  ""
  (should (equal (emagick-🐰/alist-set 'foo 'bar '())
                 '((foo . bar))))
  (should (equal (emagick-🐰/alist-set 'foo 'bar '() t)
                 '((foo bar)))))

(ert-deftest emagick-🐰/alist-set-on-list-with-element ()
  ""
  (should (equal (emagick-🐰/alist-set 'baz 'blarg '((foo . bar)))
                 '((baz . blarg)(foo . bar))))
  (should (equal (emagick-🐰/alist-set 'baz 'blarg '((foo bar)) t)
                 '((baz blarg)(foo bar)))))

(ert-deftest emagick-🐰/alist-set-on-list-without-element ()
  ""
  (should (equal (emagick-🐰/alist-set 'foo 'bar '((foo . baz)))
                 '((foo . bar))))
  (should (equal (emagick-🐰/alist-set 'foo 'bar '((foo baz)) t)
                 '((foo bar)))))
#+end_src

* Emagician Helpers
** Hook Helpers
*** Minor In Major
  
  Kinda one of those things that I am surprised is not a thing.

#+begin_src emacs-lisp
(defmacro emagician/minor-in-major-mode (minor-mode major-mode-hook)
  (let ((turn-on-symbol (intern (concat "turn-on-" (symbol-name minor-mode)))))
    (list 
     'progn 
     `(defun ,turn-on-symbol ()
        "Automagickally generated by emagicians starter kit."
        (interactive)
        (,minor-mode +1))
     `(add-hook (quote ,major-mode-hook) (quote ,turn-on-symbol)))))

(ert-deftest emagician/test-minor-in-major-mode ()
  "emagician-minor-in-major macro test"
  (should (equal (macroexpand '(emagician/minor-in-major-mode paredit-mode elisp-mode-hook))
                 '(progn
                    (defun turn-on-paredit-mode ()
                      "Automagickally generated by emagicians starter kit."
                      (interactive)
                      (paredit-mode +1))
                    (add-hook 'elisp-mode-hook 'turn-on-paredit-mode))))
  (let ((mode-hook '())
        (executed 0))
    (flet ((emagician-minor-test (arg) (setq executed (1+ executed))))
      (emagician/minor-in-major-mode emagician-minor-test mode-hook)
      (emagician/minor-in-major-mode emagician-minor-test mode-hook)
      (run-hooks 'mode-hook)
      (should (= 1 executed))
      (should (fboundp 'turn-on-emagician-minor-test))
      (fmakunbound 'turn-on-emagician-minor-test))))


(ert-deftest emagician/defhook-does-not-add-when-existant ()
  (let ((hook '())
        (executed 0))
    (emagician/defhook test-hook hook
      (setq executed (1+ executed)))
    (emagician/defhook test-hook hook
      (setq executed (1+ executed)))
    (run-hooks 'hook)
    (should (= 1 executed))
    (fmakunbound 'test-hook)))
#+end_src

*** Def hook
#+begin_src emacs-lisp
(defmacro emagician/defhook (name hook &rest b)
  (declare (indent 2))
  (let* ((docp (stringp (car b)))
         (body (if docp (cdr b) b)))
    `(progn 
       (defun ,name () 
         ,(concat (if docp (car b) "Not Documented\n") "\nEmagically defined with emagician/defhook.")
         ,@body)
       (when (or (not (boundp (quote ,hook)))
                 (not (member (quote ,name) ,hook)))
         (add-hook (quote ,hook) (quote ,name))))))
#+end_src

**** Unit tests
#+begin_src emacs-lisp 
(ert-deftest emagician/defhook-defines-hook-and-adds-it ()
  "Basic test to make sure it defines the hook function and adds it."
  (let ((hook '())
        (executed nil))
    (emagician/defhook test-hook hook
      (setq executed t))
    (run-hooks 'hook)
    (should (fboundp 'test-hook))
    (should executed)
    (fmakunbound 'test-hook)))

(ert-deftest emagician/defhook-redefines-when-bound ()
  (let ((hook '())
        (executed nil)
        (rebound nil))
    (flet ((test-hook () (setq rebound nil)))
      (emagician/defhook test-hook hook
        (setq executed t)
        (setq rebound t))
      (run-hooks 'hook)
      (should executed)
      (should rebound)
      (fmakunbound 'test-hook))))

(ert-deftest emagician/defhook-does-not-add-when-existant ()
  (let ((hook '())
        (executed 0))
    (emagician/defhook test-hook hook
      (setq executed (1+ executed)))
    (emagician/defhook test-hook hook
      (setq executed (1+ executed)))
    (run-hooks 'hook)
    (should (= 1 executed))
    (fmakunbound 'test-hook)))
#+end_src

