Emagician-Base.html

<div id="outline-container-org9a8e918" class="outline-3">
<h3 id="org9a8e918"><span class="section-number-3">3.9</span> Memory Usage</h3>
<div class="outline-text-3" id="text-3-9">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">memory-usage</span>)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org404e019" class="outline-2">
<h2 id="org404e019"><span class="section-number-2">4</span> emagick-🐰 Extensions to Emacs Lisp</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org5023e82" class="outline-3">
<h3 id="org5023e82"><span class="section-number-3">4.1</span> Test suite</h3>
<div class="outline-text-3" id="text-4-1">
<pre class="code"><code>(<span class="org-keyword">defun</span> <span class="org-function-name">emagician/meta/run-all-emagick-tests</span> ()
  <span class="org-doc">"Run all tests for emagick-&#128048;"</span> 
  (<span class="org-keyword">interactive</span>)
  (ert-run-tests-interactively <span class="org-string">"emagick"</span>))
</code></pre>
</div>
</div>

<div id="outline-container-org4eba860" class="outline-3">
<h3 id="org4eba860"><span class="section-number-3">4.2</span> alist-set: Change element in list</h3>
<div class="outline-text-3" id="text-4-2">
<pre class="code"><code>(<span class="org-keyword">defun</span> <span class="org-function-name">emagick-&#128048;/alist-set</span> (key value alist <span class="org-type">&amp;optional</span> use-proper-list)
  <span class="org-doc">"Sets or adds KEY with VALUE on ALIST, and return the list.</span>
<span class="org-doc">If USE-PROPER-LIST is true then instead of a (dotted . list) a</span>
<span class="org-doc">(proper list) is constructed insted."</span>
  (<span class="org-keyword">let</span> ((list-frag (funcall (<span class="org-keyword">if</span> use-proper-list #'list #'cons)
                            key
                            value)))
    (<span class="org-keyword">if</span> (not (null alist))
        (cons list-frag
              (assq-delete-all key alist))
      (list list-frag))))

(<span class="org-keyword">ert-deftest</span> <span class="org-function-name">emagick-&#128048;/alist-set-on-empty-list</span> ()
  <span class="org-doc">""</span>
  (<span class="org-keyword">should</span> (equal (emagick-&#128048;/alist-set 'foo 'bar '())
                 '((foo . bar))))
  (<span class="org-keyword">should</span> (equal (emagick-&#128048;/alist-set 'foo 'bar '() t)
                 '((foo bar)))))

(<span class="org-keyword">ert-deftest</span> <span class="org-function-name">emagick-&#128048;/alist-set-on-list-with-element</span> ()
  <span class="org-doc">""</span>
  (<span class="org-keyword">should</span> (equal (emagick-&#128048;/alist-set 'baz 'blarg '((foo . bar)))
                 '((baz . blarg)(foo . bar))))
  (<span class="org-keyword">should</span> (equal (emagick-&#128048;/alist-set 'baz 'blarg '((foo bar)) t)
                 '((baz blarg)(foo bar)))))

(<span class="org-keyword">ert-deftest</span> <span class="org-function-name">emagick-&#128048;/alist-set-on-list-without-element</span> ()
  <span class="org-doc">""</span>
  (<span class="org-keyword">should</span> (equal (emagick-&#128048;/alist-set 'foo 'bar '((foo . baz)))
                 '((foo . bar))))
  (<span class="org-keyword">should</span> (equal (emagick-&#128048;/alist-set 'foo 'bar '((foo baz)) t)
                 '((foo bar)))))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-orga551aab" class="outline-2">
<h2 id="orga551aab"><span class="section-number-2">5</span> Emagician Helpers</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org406730a" class="outline-3">
<h3 id="org406730a"><span class="section-number-3">5.1</span> Hook Helpers</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-orge39cd63" class="outline-4">
<h4 id="orge39cd63"><span class="section-number-4">5.1.1</span> Minor In Major</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
Kinda one of those things that I am surprised is not a thing.
</p>

<pre class="code"><code>(<span class="org-keyword">defmacro</span> <span class="org-function-name">emagician/minor-in-major-mode</span> (minor-mode major-mode-hook)
  (<span class="org-keyword">let</span> ((turn-on-symbol (intern (concat <span class="org-string">"turn-on-"</span> (symbol-name minor-mode)))))
    (list 
     'progn 
     `(<span class="org-keyword">defun</span> ,turn-on-symbol ()
        <span class="org-doc">"Automagickally generated by emagicians starter kit."</span>
        (<span class="org-keyword">interactive</span>)
        (,minor-mode +1))
     `(add-hook (<span class="org-keyword">quote</span> ,major-mode-hook) (<span class="org-keyword">quote</span> ,turn-on-symbol)))))

(<span class="org-keyword">ert-deftest</span> <span class="org-function-name">emagician/test-minor-in-major-mode</span> ()
  <span class="org-doc">"emagician-minor-in-major macro test"</span>
  (<span class="org-keyword">should</span> (equal (macroexpand '(emagician/minor-in-major-mode paredit-mode elisp-mode-hook))
                 '(<span class="org-keyword">progn</span>
                    (<span class="org-keyword">defun</span> <span class="org-function-name">turn-on-paredit-mode</span> ()
                      <span class="org-doc">"Automagickally generated by emagicians starter kit."</span>
                      (<span class="org-keyword">interactive</span>)
                      (paredit-mode +1))
                    (add-hook 'elisp-mode-hook 'turn-on-paredit-mode))))
  (<span class="org-keyword">let</span> ((mode-hook '())
        (executed 0))
    (<span class="org-keyword">flet</span> ((emagician-minor-test (arg) (<span class="org-keyword">setq</span> executed (1+ executed))))
      (<span class="org-keyword">emagician/minor-in-major-mode</span> emagician-minor-test mode-hook)
      (<span class="org-keyword">emagician/minor-in-major-mode</span> emagician-minor-test mode-hook)
      (run-hooks 'mode-hook)
      (<span class="org-keyword">should</span> (= 1 executed))
      (<span class="org-keyword">should</span> (fboundp 'turn-on-emagician-minor-test))
      (fmakunbound 'turn-on-emagician-minor-test))))


(<span class="org-keyword">ert-deftest</span> <span class="org-function-name">emagician/defhook-does-not-add-when-existant</span> ()
  (<span class="org-keyword">let</span> ((hook '())
        (executed 0))
    (<span class="org-keyword">emagician/defhook</span> test-hook hook
      (<span class="org-keyword">setq</span> executed (1+ executed)))
    (<span class="org-keyword">emagician/defhook</span> test-hook hook
      (<span class="org-keyword">setq</span> executed (1+ executed)))
    (run-hooks 'hook)
    (<span class="org-keyword">should</span> (= 1 executed))
    (fmakunbound 'test-hook)))
</code></pre>
</div>
</div>

<div id="outline-container-org8554f90" class="outline-4">
<h4 id="org8554f90"><span class="section-number-4">5.1.2</span> Def hook</h4>
<div class="outline-text-4" id="text-5-1-2">
<pre class="code"><code>(<span class="org-keyword">defmacro</span> <span class="org-function-name">emagician/defhook</span> (name hook <span class="org-type">&amp;rest</span> b)
  (<span class="org-keyword">declare</span> (indent 2))
  (<span class="org-keyword">let*</span> ((docp (stringp (car b)))
         (body (<span class="org-keyword">if</span> docp (cdr b) b)))
    `(<span class="org-keyword">progn</span> 
       (<span class="org-keyword">defun</span> ,name () 
         ,(concat (<span class="org-keyword">if</span> docp (car b) <span class="org-string">"Not Documented\n"</span>) <span class="org-string">"\nEmagically defined with emagician/defhook."</span>)
         ,@body)
       (<span class="org-keyword">when</span> (<span class="org-keyword">or</span> (not (boundp (<span class="org-keyword">quote</span> ,hook)))
                 (not (member (<span class="org-keyword">quote</span> ,name) ,hook)))
         (add-hook (<span class="org-keyword">quote</span> ,hook) (<span class="org-keyword">quote</span> ,name))))))
</code></pre>
</div>

<div id="outline-container-org2780b8e" class="outline-5">
<h5 id="org2780b8e"><span class="section-number-5">5.1.2.1</span> Unit tests</h5>
<div class="outline-text-5" id="text-5-1-2-1">
<pre class="code"><code>(<span class="org-keyword">ert-deftest</span> <span class="org-function-name">emagician/defhook-defines-hook-and-adds-it</span> ()
  <span class="org-doc">"Basic test to make sure it defines the hook function and adds it."</span>
  (<span class="org-keyword">let</span> ((hook '())
        (executed nil))
    (<span class="org-keyword">emagician/defhook</span> test-hook hook
      (<span class="org-keyword">setq</span> executed t))
    (run-hooks 'hook)
    (<span class="org-keyword">should</span> (fboundp 'test-hook))
    (<span class="org-keyword">should</span> executed)
    (fmakunbound 'test-hook)))

(<span class="org-keyword">ert-deftest</span> <span class="org-function-name">emagician/defhook-redefines-when-bound</span> ()
  (<span class="org-keyword">let</span> ((hook '())
        (executed nil)
        (rebound nil))
    (<span class="org-keyword">flet</span> ((test-hook () (<span class="org-keyword">setq</span> rebound nil)))
      (<span class="org-keyword">emagician/defhook</span> test-hook hook
        (<span class="org-keyword">setq</span> executed t)
        (<span class="org-keyword">setq</span> rebound t))
      (run-hooks 'hook)
      (<span class="org-keyword">should</span> executed)
      (<span class="org-keyword">should</span> rebound)
      (fmakunbound 'test-hook))))

(<span class="org-keyword">ert-deftest</span> <span class="org-function-name">emagician/defhook-does-not-add-when-existant</span> ()
  (<span class="org-keyword">let</span> ((hook '())
        (executed 0))
    (<span class="org-keyword">emagician/defhook</span> test-hook hook
      (<span class="org-keyword">setq</span> executed (1+ executed)))
    (<span class="org-keyword">emagician/defhook</span> test-hook hook
      (<span class="org-keyword">setq</span> executed (1+ executed)))
    (run-hooks 'hook)
    (<span class="org-keyword">should</span> (= 1 executed))
    (fmakunbound 'test-hook)))
</code></pre>
</div>
</div>
</div>
</div>
