Emagician-Base.html

<div id="outline-container-orgdde00cc" class="outline-3">
<h3 id="orgdde00cc"><span class="section-number-3">5.2</span> Backtrace Magick</h3>
<div class="outline-text-3" id="text-5-2">
<p>
HOLY SHIT. This worked better than I expected. 
</p>

<p>
This function snarfs the backtrace when called and returns it as a list.   This is used primarily for initialization testing.
</p>

<p>
(load-file-name or buffer-file-name)
</p>

<pre class="code"><code>(<span class="org-keyword">defun</span> <span class="org-function-name">emagician/snarf-backtrace</span> ()
  <span class="org-doc">"Snarfs the backtrace as a list"</span>
  (<span class="org-keyword">let</span> ((num 3)
        (frames (cons (backtrace-frame 3) nil)))
    (<span class="org-keyword">while</span> (car frames)
      (<span class="org-keyword">when</span> (&gt; num 50) (<span class="org-warning">error</span> <span class="org-string">"Too many frames %S"</span> (pp frames)))
      (<span class="org-keyword">setq</span> num (1+ num))
      (<span class="org-keyword">setq</span> frames (cons (backtrace-frame (+ 3 num)) frames)))
    (cdr frames)))

(<span class="org-keyword">ert-deftest</span> <span class="org-function-name">emagician/snarf-backtrace</span> ()
  (<span class="org-keyword">should</span> (equal '(t emagician/snarf-backtrace) (car (last (emagician/snarf-backtrace))))))
</code></pre>
</div>
</div>

<div id="outline-container-org8938658" class="outline-3">
<h3 id="org8938658"><span class="section-number-3">5.3</span> Sanitize File name</h3>
<div class="outline-text-3" id="text-5-3">
<p>
A bit of a naive version of this for now.
</p>

<pre class="code"><code>(<span class="org-keyword">defun</span> <span class="org-function-name">emagician/sanitize-file-name</span> (str)
  (replace-regexp-in-string <span class="org-string">"[/~\000]"</span> <span class="org-string">"-"</span> str))

</code></pre>

<pre class="code"><code>(<span class="org-keyword">ert-deftest</span> <span class="org-function-name">emagician/sanitize-file-name</span> ()
  (<span class="org-keyword">should</span> (equal <span class="org-string">""</span> (emagician/sanitize-file-name <span class="org-string">""</span>)))
  (<span class="org-keyword">should</span> (equal <span class="org-string">"foo"</span> (emagician/sanitize-file-name <span class="org-string">"foo"</span>)))
  (<span class="org-keyword">should</span> (equal <span class="org-string">"-foo"</span> (emagician/sanitize-file-name <span class="org-string">"/foo"</span>)))
  (<span class="org-keyword">should</span> (equal <span class="org-string">"-foo"</span> (emagician/sanitize-file-name <span class="org-string">"~foo"</span>))))
</code></pre>
</div>
</div>

<div id="outline-container-orgceaac27" class="outline-3">
<h3 id="orgceaac27"><span class="section-number-3">5.4</span> Expect Dir</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Make sure a dirs exist.
</p>

<pre class="code"><code>(<span class="org-keyword">defun</span> <span class="org-function-name">emagician/expect-dir</span> (dir <span class="org-type">&amp;optional</span> pathroot) 
  <span class="org-doc">"Ensures that the named directory exists."</span>
  (<span class="org-keyword">let</span> ((path (expand-file-name dir
                                (<span class="org-keyword">or</span> pathroot emagician/dir))))
    (<span class="org-keyword">when</span> (not (file-directory-p path))
      (<span class="org-keyword">when</span> (file-exists-p path)
        (<span class="org-warning">error</span> <span class="org-string">"Cannot Create %s, it already exists and is a file."</span> path))
      (make-directory path nil))
    path))

</code></pre>

<pre class="code"><code>(<span class="org-keyword">ert-deftest</span> <span class="org-function-name">emagician/expect-dir</span> ()
  (<span class="org-keyword">let</span> ((tdir <span class="org-string">"emagician-expect-dir-scratch-monkey"</span>))   
    (<span class="org-keyword">should</span> (not (file-directory-p tdir)))
    (<span class="org-keyword">should</span> (file-directory-p (emagician/expect-dir <span class="org-string">"emagician-expect-dir-dummy-test-dir"</span>)))
    (<span class="org-keyword">should</span> (file-directory-p (emagician/expect-dir <span class="org-string">"emagician-expect-dir-dummy-test-dir"</span>)))
    (<span class="org-keyword">should</span> (<span class="org-keyword">progn</span> (delete-directory tdir) (not (file-directory-p tdir))))
    (<span class="org-keyword">should-error</span> (emagician/expect-dir <span class="org-string">"foo/bar/baz/notexisting"</span>)))
  (<span class="org-keyword">should-error</span> (emagician/expect-dir <span class="org-string">"Emagician.org"</span>)))

(<span class="org-keyword">ert-deftest</span> <span class="org-function-name">emagician/expect-dir-with-extra-arg</span> ()
  (<span class="org-keyword">let*</span> ((dirname <span class="org-string">"emagician-expect-dir-scratch-monkey"</span>)
         (tdir (concat temporary-file-directory dirname)))
    (<span class="org-keyword">should</span> (not (file-directory-p tdir)))
    (<span class="org-keyword">should</span> (file-directory-p (emagician/expect-dir dirname
                                                    temporary-file-directory)))
    (<span class="org-keyword">should</span> (<span class="org-keyword">progn</span> (delete-directory tdir)
                   (not (file-directory-p tdir))))))
</code></pre>
</div>
</div>

<div id="outline-container-org2317285" class="outline-3">
<h3 id="org2317285"><span class="section-number-3">5.5</span> Add to Path</h3>
<div class="outline-text-3" id="text-5-5">
<pre class="code"><code>  (<span class="org-keyword">defun</span> <span class="org-function-name">emagician/add-to-path</span> (path <span class="org-type">&amp;rest</span> front)
    <span class="org-doc">"Adds PATH to the PATH env variable, eshell-path-env as well as exec-path.</span>
<span class="org-doc">If FRONT is non nil, then PATH will be prepended to the env and shell vars.  </span>
<span class="org-doc">The exec-path always will always have it prepended. "</span>
    (<span class="org-keyword">let</span> ((shell-path (concat 
                       (<span class="org-keyword">if</span> front 
                           path
                         (getenv <span class="org-string">"PATH"</span>))
                       <span class="org-string">":"</span>
                       (<span class="org-keyword">if</span> front
                           (getenv <span class="org-string">"PATH"</span>)
                         path))))
      (setenv <span class="org-string">"PATH"</span> shell-path)
      (<span class="org-keyword">setq</span> eshell-path-env shell-path)
      (<span class="org-keyword">setq</span> exec-path (cons path exec-path))))

</code></pre>
</div>
</div>

<div id="outline-container-org40cf2a7" class="outline-3">
<h3 id="org40cf2a7"><span class="section-number-3">5.6</span> Final Emagician Scratch</h3>
<div class="outline-text-3" id="text-5-6">
<p>
When the starter kit is loaded we want to display the scratch buffer
with a new and improved scratch buffer giving some statistics, showing
inspirational messages, dire warnings, and apocalyptic screeds.
</p>

<p>
We also show a set of quick elisp commands that can be immediately run
by moving the point to the relevant line of elisp, and executing. 
</p>

<p>
This exemplifies everything that is good with Emacs. 
</p>

<p>
If you want to add items, you can do so through the
<code>emagician/scratch-links</code> variable.
</p>

<pre class="code"><code>(<span class="org-keyword">defvar</span> <span class="org-variable-name">emagician/scratch-links</span> `((magit-status ,emagician/dir))
  <span class="org-doc">"A list of elisp that is inserted in the scratch buffer at startup."</span>)
</code></pre>
</div>
