Emagician-Base.org
*** Scratchify
#+begin_src emacs-lisp 
  (defun emagician/scratchify-text (text-or-list)
    "Takes a chunk of text, and at the newline boundary inserts ;;;
If it's a list, then scratchify the list members."
    (cond
     ((null text-or-list) nil)
     ((and (stringp text-or-list) (equal "" text-or-list))
      ";;;\n")
     ((listp text-or-list)
      (mapconcat 'emagician/scratchify-text text-or-list ""))
     ((stringp text-or-list)
      (mapconcat (lambda (line)
                   (format ";;; %s\n" line))
                 (split-string text-or-list "\n")
                 ""))))
#+end_src

#+begin_src emacs-lisp 
(ert-deftest emagician/scratchify-text-props ()
  (should (equal ";;; foo\n" (emagician/scratchify-text (propertize "foo" 'face '(:foreground "red"))))))

(ert-deftest emagician/scratchify-text ()
  (should (equal ";;; foo\n" (emagician/scratchify-text "foo")))
  (should (equal ";;; Topes\n;;; \n" (emagician/scratchify-text "Topes\n"))))

(ert-deftest emagician/scratchify-list ()
  (should (equal ";;; foo\n" (emagician/scratchify-text '("foo"))))
  (should (equal ";;; foo\n;;; bar\n" (emagician/scratchify-text '("foo" "bar")))))

(ert-deftest emagician/scratchify-list-in-list ()
  (should (equal ";;; foo\n;;; bar\n" (emagician/scratchify-text '("foo" ("bar"))))))

(ert-deftest emagician/scratchify-empty ()
  (should (equal ";;;\n" (emagician/scratchify-text ""))))
#+end_src

*** Reset Scratch
#+begin_src emacs-lisp 
(defun emagician/reset-scratch (str)
  (with-current-buffer "*scratch*"
    (lisp-interaction-mode)
    (font-lock-mode -1)
    (whitespace-mode -1)
    (erase-buffer)
    (insert str)))
#+end_src

*** Main Scratch Initiation
#+begin_src emacs-lisp 
(defun emagician/initiate-thee-scratch ()
  (flet ((with-bg-fg (str bg fg)
           (propertize str
                       'face
                       (list :background bg :foreground fg)))
         (with-fg (str fg)
           (propertize str
                       'face
                       (list :foreground fg))))
    (let* ((banner-color "DarkViolet")
           (info-label "DeepSkyBlue")
           (info-value "cyan" )
           (banner-line (with-fg (make-string 72 ?█) banner-color))
           (header
            `(,banner-line
              ,(with-bg-fg "████            🐰-|-+-|- Sekrut Alien Technology -|-+-|-🐰         ███" info-label banner-color)
              ,banner-line
              ""
              "     It is with the Quill of Echinda I scratch upon the beat mesa."
              ""
              ,banner-line
              ,(concat (with-fg "Emacs Version:     " info-label)
                       (with-fg emacs-version info-value))
              ,(concat (with-fg "Emagician Verison: " info-label)
                       (with-fg emagician/version info-value))))
           (startup-time
            `(,banner-line
              ,(if before-init-time
                   (concat (with-fg "🕚 Startup Time:   " info-label)
                           (with-fg (format "%.2f" (- (float-time)
                                                      (float-time before-init-time)))
                                    info-value))
                 (propertize "⁇ before-init-time is null!" :face 'error-face))
              ,(mapcar (lambda (s) (format "  %65s %.2f" (car s) (cdr s)))
                       emagician/slow-loaders)))
           (chaotic-wisdom
            `(,banner-line
              ,(emagician/cookie-from-file "assets/collected-works-ov-chaos.lines")))
           (minor-lamp-invocation
            `(,banner-line
              ,(emagician/cookie-from-file "assets/minor-lamp-invocation.lines")))
           (tools
            (mapconcat (lambda (link )
                         (format "%S\n" link))
                       emagician/scratch-links
                       "")))
      (emagician/reset-scratch
       (concat (emagician/scratchify-text
                (list header
                      startup-time
                      chaotic-wisdom
                      minor-lamp-invocation
                      banner-line))
               "\n"
               tools
               "\n"
               (emagician/scratchify-text banner-line))))))
#+end_src

 
