Emagician-Base.html

<div id="outline-container-org2b809d9" class="outline-4">
<h4 id="org2b809d9"><span class="section-number-4">5.6.1</span> Scratchify</h4>
<div class="outline-text-4" id="text-5-6-1">
<pre class="code"><code>  (<span class="org-keyword">defun</span> <span class="org-function-name">emagician/scratchify-text</span> (text-or-list)
    <span class="org-doc">"Takes a chunk of text, and at the newline boundary inserts ;;;</span>
<span class="org-doc">If it's a list, then scratchify the list members."</span>
    (<span class="org-keyword">cond</span>
     ((null text-or-list) nil)
     ((<span class="org-keyword">and</span> (stringp text-or-list) (equal <span class="org-string">""</span> text-or-list))
      <span class="org-string">";;;\n"</span>)
     ((listp text-or-list)
      (mapconcat 'emagician/scratchify-text text-or-list <span class="org-string">""</span>))
     ((stringp text-or-list)
      (mapconcat (<span class="org-keyword">lambda</span> (line)
                   (format <span class="org-string">";;; </span><span class="org-outshine-level-1">%s\n" line))</span>
                 (split-string text-or-list <span class="org-string">"\n"</span>)
                 <span class="org-string">""</span>))))
</code></pre>

<pre class="code"><code>(<span class="org-keyword">ert-deftest</span> <span class="org-function-name">emagician/scratchify-text-props</span> ()
  (<span class="org-keyword">should</span> (equal <span class="org-string">";;; </span><span class="org-outshine-level-1">foo\n" (emagician/scratchify-text (propertize "foo" 'face '(:foreground "red"))))))</span>

(<span class="org-keyword">ert-deftest</span> <span class="org-function-name">emagician/scratchify-text</span> ()
  (<span class="org-keyword">should</span> (equal <span class="org-string">";;; </span><span class="org-outshine-level-1">foo\n" (emagician/scratchify-text "foo")))</span>
  (<span class="org-keyword">should</span> (equal <span class="org-string">";;; </span><span class="org-outshine-level-1">Topes\n;;; \n" (emagician/scratchify-text "Topes\n"))))</span>

(<span class="org-keyword">ert-deftest</span> <span class="org-function-name">emagician/scratchify-list</span> ()
  (<span class="org-keyword">should</span> (equal <span class="org-string">";;; </span><span class="org-outshine-level-1">foo\n" (emagician/scratchify-text '("foo"))))</span>
  (<span class="org-keyword">should</span> (equal <span class="org-string">";;; </span><span class="org-outshine-level-1">foo\n;;; bar\n" (emagician/scratchify-text '("foo" "bar")))))</span>

(<span class="org-keyword">ert-deftest</span> <span class="org-function-name">emagician/scratchify-list-in-list</span> ()
  (<span class="org-keyword">should</span> (equal <span class="org-string">";;; </span><span class="org-outshine-level-1">foo\n;;; bar\n" (emagician/scratchify-text '("foo" ("bar"))))))</span>

(<span class="org-keyword">ert-deftest</span> <span class="org-function-name">emagician/scratchify-empty</span> ()
  (<span class="org-keyword">should</span> (equal <span class="org-string">";;;\n"</span> (emagician/scratchify-text <span class="org-string">""</span>))))
</code></pre>
</div>
</div>

<div id="outline-container-org84b69da" class="outline-4">
<h4 id="org84b69da"><span class="section-number-4">5.6.2</span> Reset Scratch</h4>
<div class="outline-text-4" id="text-5-6-2">
<pre class="code"><code>(<span class="org-keyword">defun</span> <span class="org-function-name">emagician/reset-scratch</span> (str)
  (<span class="org-keyword">with-current-buffer</span> <span class="org-string">"*scratch*"</span>
    (lisp-interaction-mode)
    (font-lock-mode -1)
    (whitespace-mode -1)
    (erase-buffer)
    (insert str)))
</code></pre>
</div>
</div>

<div id="outline-container-orgddcea02" class="outline-4">
<h4 id="orgddcea02"><span class="section-number-4">5.6.3</span> Main Scratch Initiation</h4>
<div class="outline-text-4" id="text-5-6-3">
<pre class="code"><code>(<span class="org-keyword">defun</span> <span class="org-function-name">emagician/initiate-thee-scratch</span> ()
  (<span class="org-keyword">flet</span> ((with-bg-fg (str bg fg)
           (propertize str
                       'face
                       (list <span class="org-builtin">:background</span> bg <span class="org-builtin">:foreground</span> fg)))
         (with-fg (str fg)
           (propertize str
                       'face
                       (list <span class="org-builtin">:foreground</span> fg))))
    (<span class="org-keyword">let*</span> ((banner-color <span class="org-string">"DarkViolet"</span>)
           (info-label <span class="org-string">"DeepSkyBlue"</span>)
           (info-value <span class="org-string">"cyan"</span> )
           (banner-line (with-fg (make-string 72 ?&#9608;) banner-color))
           (header
            `(,banner-line
              ,(with-bg-fg <span class="org-string">"&#9608;&#9608;&#9608;&#9608;            &#128048;-|-+-|- Sekrut Alien Technology -|-+-|-&#128048;         &#9608;&#9608;&#9608;"</span> info-label banner-color)
              ,banner-line
              <span class="org-string">""</span>
              <span class="org-string">"     It is with the Quill of Echinda I scratch upon the beat mesa."</span>
              <span class="org-string">""</span>
              ,banner-line
              ,(concat (with-fg <span class="org-string">"Emacs Version:     "</span> info-label)
                       (with-fg emacs-version info-value))
              ,(concat (with-fg <span class="org-string">"Emagician Verison: "</span> info-label)
                       (with-fg emagician/version info-value))))
           (startup-time
            `(,banner-line
              ,(<span class="org-keyword">if</span> before-init-time
                   (concat (with-fg <span class="org-string">"&#128346; Startup Time:   "</span> info-label)
                           (with-fg (format <span class="org-string">"%.2f"</span> (- (float-time)
                                                      (float-time before-init-time)))
                                    info-value))
                 (propertize <span class="org-string">"&#8263; before-init-time is null!"</span> <span class="org-builtin">:face</span> 'error-face))
              ,(mapcar (<span class="org-keyword">lambda</span> (s) (format <span class="org-string">"  %65s %.2f"</span> (car s) (cdr s)))
                       emagician/slow-loaders)))
           (chaotic-wisdom
            `(,banner-line
              ,(emagician/cookie-from-file <span class="org-string">"assets/collected-works-ov-chaos.lines"</span>)))
           (minor-lamp-invocation
            `(,banner-line
              ,(emagician/cookie-from-file <span class="org-string">"assets/minor-lamp-invocation.lines"</span>)))
           (tools
            (mapconcat (<span class="org-keyword">lambda</span> (link )
                         (format <span class="org-string">"%S\n"</span> link))
                       emagician/scratch-links
                       <span class="org-string">""</span>)))
      (emagician/reset-scratch
       (concat (emagician/scratchify-text
                (list header
                      startup-time
                      chaotic-wisdom
                      minor-lamp-invocation
                      banner-line))
               <span class="org-string">"\n"</span>
               tools
               <span class="org-string">"\n"</span>
               (emagician/scratchify-text banner-line))))))
</code></pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jonathan Arkell</p>
<p class="date">Created: 2018-05-18 Fri 10:31</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
